
#Область ОбработчикСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();   
	Салон = Справочники.Салоны.ОсновнойСалон();	
	СоздатьИзмеренияПланировщика();
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗаписей();
	
КонецПроцедуры

 &НаСервере
Процедура ОбновитьПериодОтображенияПланировщика()

	Начало = НачалоДня(Дата) + 9*3600;
	Конец = НачалоДня(Дата) + 19*3600;
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(Начало, Конец);

КонецПроцедуры 

&НаСервере
Процедура СоздатьИзмеренияПланировщика()

	Измерение = Планировщик.Измерения.Добавить("Сотрудник");
	
	Выборка = Справочники.Сотрудники.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда                            
			Продолжить;		
		КонецЕсли;
		ЗначениеИзмерения = Измерение.Элементы.Добавить(Выборка.Ссылка);
		ЗначениеИзмерения.Текст = Выборка.Наименование + Символы.ПС + Выборка.Должность;
		ЗначениеИзмерения.ЦветРамки = WebЦвета.Синий;
	
	КонецЦикла;


КонецПроцедуры // ()

&НаСервере
Процедура ЗаполнитьЖурналЗаписей()
	
	Планировщик.Элементы.Очистить();
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Запись.Дата,
		|	Запись.Салон,
		|	Запись.Сотрудник,
		|	ПРЕДСТАВЛЕНИЕ(Запись.Услуга) КАК Услуга,
		|	Запись.Длительность,
		|	Запись.Сумма,
		|	Запись.Клиент,
		|	Запись.Клиент.Телефон,
		|	Запись.Комментарии,
		|	Запись.ДатаОкончания,
		|	Запись.Ссылка,
		|	Запись.Цвет
		|ИЗ
		|	Документ.Запись КАК Запись
		|ГДЕ
		|	Запись.Проведен
		|	И Запись.Салон = &Салон
		|	И Запись.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	Запрос.УстановитьПараметр("Салон", Салон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоотвествиеИзмерения = Новый Соответствие;
		СоотвествиеИзмерения.Вставить("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
		
		МассивСтрок = Новый Массив;
		
		ПредставлениеКлиента = Строка(ВыборкаДетальныеЗаписи.Клиент) + ", " + ВыборкаДетальныеЗаписи.КлиентТелефон; 
		МассивСтрок.Добавить(ПредставлениеКлиента);                       
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить(ВыборкаДетальныеЗаписи.Услуга);
		МассивСтрок.Добавить(Символы.ПС);
		МассивСтрок.Добавить(ВыборкаДетальныеЗаписи.Комментарии);
		
		ЭлиментПланировщика = Планировщик.Элементы.Добавить(ВыборкаДетальныеЗаписи.Дата, ВыборкаДетальныеЗаписи.ДатаОкончания);	
		ЭлиментПланировщика.ЗначенияИзмерений = Новый ФиксированноеСоответствие(СоотвествиеИзмерения);
		ЭлиментПланировщика.Значение = ВыборкаДетальныеЗаписи.Ссылка;
		ЭлиментПланировщика.Текст = Новый ФорматированнаяСтрока(МассивСтрок);
		Цвет = ВыборкаДетальныеЗаписи.Цвет.Получить();
		Если Цвет <> Неопределено Тогда
		                              
			ЭлиментПланировщика.ЦветФона = Цвет;
		
		КонецЕсли;                     
		
	КонецЦикла;

	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	ЗаполнитьДиаграмму();
	
КонецПроцедуры // ЗаполнитьЖурналЗаписей()

&НаСервере
Процедура ЗаполнитьДиаграмму()
     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДеньгиОбороты.СуммаПриход,
		|	ДеньгиОбороты.ТипДенежныхСредств
		|ИЗ
		|	РегистрНакопления.Деньги.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ДеньгиОбороты";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Диаграмма.Очистить();
	Диаграмма.Обновление = Ложь;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Точка = Диаграмма.Точки.Добавить("");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Серия = Диаграмма.Серии.Добавить(Строка(ВыборкаДетальныеЗаписи.ТипДенежныхСредств));
		Диаграмма.УстановитьЗначение(Точка, Серия, ВыборкаДетальныеЗаписи.СуммаПриход);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
                                
	Диаграмма.Обновление = Истина;
	

КонецПроцедуры // ЗаполнитьДиаграмму()

#КонецОбласти

#Область ОбработкаРаботыПланировщика
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗаписей();
КонецПроцедуры

&НаКлиенте
Процедура СалонПриИзменении(Элемент)
	ОбновитьПериодОтображенияПланировщика();
	ЗаполнитьЖурналЗаписей();
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Дата", Начало);
	ЗначенияЗаполнения.Вставить("ДатаОкончания", Конец);
	ЗначенияЗаполнения.Вставить("Сотрудник",ЗначенияИзмерений["Сотрудник"]);
	ЗначенияЗаполнения.Вставить("Салон", Салон);
	
	СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.Запись.ФормаОбъекта", СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Изменение_Запись" Тогда
	
		ЗаполнитьЖурналЗаписей();	
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы;
	
	ЭлиментПланировщика = ВыделенныеЭлементы[0];
	СтруктураПараметров = Новый Структура("Ключ", ЭлиментПланировщика.Значение);
	ОткрытьФорму("Документ.Запись.ФормаОбъекта",СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	ВыделенныеЭлементы = Элемент.ВыделенныеЭлементы;
	ЭлиментПланировщика = ВыделенныеЭлементы[0];
	
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("Дата",ЭлиментПланировщика.Начало);
	ЗначенияРеквизитов.Вставить("ДатаОкончания",ЭлиментПланировщика.Конец);
	ЗначенияРеквизитов.Вставить("Сотрудник", ЭлиментПланировщика.ЗначенияИзмерений["Сотрудник"]);
	
	ОбновитьДанныеЗаписи(ЭлиментПланировщика.Значение, ЗначенияРеквизитов);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьДанныеЗаписи(Запись, ЗначенияРеквизитов)
	           
	ОбъектЗаписи = Запись.ПолучитьОбъект();
	ЕстьИзменения = Ложь;
	
	Для каждого Реквизит Из ЗначенияРеквизитов Цикл	
		Если ОбъектЗаписи[Реквизит.Ключ] <> Реквизит.Значение Тогда
		    ЕстьИзменения = Истина;
			Прервать; 
		КонецЕсли;	
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		ЗаполнитьЗначенияСвойств(ОбъектЗаписи, ЗначенияРеквизитов);
		ОбъектЗаписи.Длительность = (ОбъектЗаписи.ДатаОкончания - ОбъектЗаписи.Дата) / 60;
		ОбъектЗаписи.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	

КонецПроцедуры // ()

	
#КонецОбласти

