Функция ОсновнойСалон() Экспорт

	      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Салоны.Ссылка
		|ИЗ
		|	Справочник.Салоны КАК Салоны
		|ГДЕ
		|	НЕ Салоны.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Салон = Справочники.Салоны.ПустаяСсылка();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	                                 
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();		
		Салон = ВыборкаДетальныеЗаписи.Ссылка;		
	КонецЕсли;                       	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

    Возврат Салон; 
КонецФункции // ()
